//----------------------------------------------------------------------------------------------------
#ifndef __DEV_HPP
    #define __DEV_HPP

#include    "RTX_CAN.h"
#include    "main.h"
//----------------------------------------------------------------------------------------------------
//C++类定义
//-------------------------------------------------------
#ifdef    _IN_DEV_CPP
    #define   dev_ext
#else
    #define   dev_ext extern
#endif
//----------------------------------------------------------------------------------------------------
#define   DEVINFO_MARK      (0x00020000|(MAX_CHAN_NUM))     // 设备信息标记字 2016-0125

//#define   CTRLCFG_MARK      (0x00040000|(MAX_CHAN_NUM))     // 设备控制配置标记字 2016-0125
#define   CTRLCFG_MARK      (0x00050000|DEV_STR_TYPE)       // 设备控制配置标记字 2016-0607 与结构相关
    
#define   SUBCHCFG_MARK     (0x00010001)                    // 辅助通道硬件配置标记字

#define   VIHDCFG_MARK      (0x00020000|DEV_STR_TYPE)       // 单体电压硬件配置标记字(与硬件结构相关) 16-0125
#define   TIHDCFG_MARK      (0x00020000|DEV_STR_TYPE)       // 单体温度硬件配置标记字(与硬件结构相关) 16-0125
#define   IIHDCFG_MARK      (0x00020000|DEV_STR_TYPE)       // 开关量入硬件配置标记字(与硬件结构相关) 16-0125
#define   OIHDCFG_MARK      (0x00020000|DEV_STR_TYPE)       // 开关量出硬件配置标记字(与硬件结构相关) 16-0125
#define   XIHDCFG_MARK      (0x00020000|DEV_STR_TYPE)       // 其他辅助硬件配置标记字(与硬件结构相关) 16-0125

#define   SAMPCFG_MARK      (0x00010002)                    // 辅助通道配置表标记字

#define   TEMPTBL_MARK      (0x00010002)                    // 温度配置表标记字


//const U8      U8MSK[8]        = {0x01,0x02,0x04,0x08,0x10,0x20,0x40,0x80};
const unsigned short    U16HMSK[8]      = {0x0000,0x0100,0x0200,0x0300,0x0400,0x0500,0x0600,0x0700};
//----------------------------------------------------------------------------------------------------
//  设备额定默认与限制 16-0125
#define     DEF_CHR_CUR         (10000.0L)      // 默认最大充电电流(mA)
#define     DEF_DCH_CUR         (10000.0L)      // 默认最大放电电流(mA)
#define     DEF_CHR_VOL         (5000.0L)       // 默认最大充电电压(mV)
#define     DEF_DCH_VOL         (0.0L)          // 默认最小放电电压(mV)

#define     MAX_CHR_CUR         (20000000.0L)   // 允许最大充电电流(mA)
#define     MAX_DCH_CUR         (20000000.0L)   // 允许最大放电电流(mA)
#define     MAX_CHR_VOL         (1000000.0L)    // 允许最大充电电压(mV)
#define     MIN_DCH_VOL         (-100000.0L)    // 允许最小放电电压(mV)
//--------------------------------------------------
#define     RUN_FANON_TEMP      (25.0L)         // 风机正常开启温度(℃)
#define     PROT_FANON_TEMP     (65.0L)         // 风机保护开启温度(℃)

#define     MAX_FANON_TEMP      (200.0L)        // 最大风机开启温度(℃)
#define     MIN_FANON_TEMP      (-20.0L)        // 最小风机开启温度(℃)
//----------------------------------------------------------------------------------------------------
//  cDev.wmfunc_cfg 工作模式功能位配置 （0：屏蔽，1：开启）15-1124
//----------
#define   WMFUNC_BIT_CCC        ((U32)(1 << 0))   // 恒流充电   功能位
#define   WMFUNC_BIT_CVC        ((U32)(1 << 1))   // 恒压充电   功能位
#define   WMFUNC_BIT_CCD        ((U32)(1 << 2))   // 恒流放电   功能位
#define   WMFUNC_BIT_CVD        ((U32)(1 << 3))   // 恒压放电   功能位
#define   WMFUNC_BIT_CPD        ((U32)(1 << 4))   // 恒功率放电  功能位
#define   WMFUNC_BIT_CPC        ((U32)(1 << 5))   // 恒功率充电  功能位
#define   WMFUNC_BIT_CRD        ((U32)(1 << 6))   // 恒电阻放电  功能位
#define   WMFUNC_BIT_STATIC     ((U32)(1 << 7))   // 静置（搁置） 功能位
#define   WMFUNC_BIT_PULSE_C    ((U32)(1 << 8))   // 脉冲充电   功能位
#define   WMFUNC_BIT_PULSE_D    ((U32)(1 << 9))   // 脉冲放电   功能位
#define   WMFUNC_BIT_PULSE_S    ((U32)(1 <<10))   // 脉冲静置   功能位
#define   WMFUNC_BIT_LINE_D     ((U32)(1 <<11))   // 线性放电   功能位
#define   WMFUNC_BIT_IF         ((U32)(1 <<12))   // 如果（虚模式）  功能位
#define   WMFUNC_BIT_ELSE       ((U32)(1 <<13))   // 否则（虚模式）  功能位
#define   WMFUNC_BIT_VAR_OPT    ((U32)(1 <<14))   // 变量操作   功能位
#define   WMFUNC_BIT_CYC        ((U32)(1 <<15))   // 循环
#define   WMFUNC_BIT_PULSE_INT  ((U32)(1 <<16))   // 间歇脉冲
#define   WMFUNC_BIT_PULSE_ON   ((U32)(1 <<17))   // 正负脉冲
#define   WMFUNC_BIT_EXT_CTRL   ((U32)(1 <<18))   // 外控
#define   WMFUNC_BIT_CRC        ((U32)(1 <<19))   // 恒阻充电

//----- 默认开启工作模式 -----
#define   DEFAULT_WMFUNC_BIT    ( WMFUNC_BIT_CCC      \
                                | WMFUNC_BIT_CVC      \
                                | WMFUNC_BIT_CCD      \
                                | WMFUNC_BIT_STATIC   \
                                | WMFUNC_BIT_IF       \
                                | WMFUNC_BIT_ELSE     \
                                | WMFUNC_BIT_VAR_OPT  \
                                )
//----- 数据类型位定义 -----   // 16-0505
typedef union   _unWmFunc_
{
    struct {
        U32 bCCC        : 1;
        U32 bCVC        : 1;
        U32 bCCD        : 1;
        U32 bCVD        : 1;
        U32 bCPD        : 1;
        U32 bCPC        : 1;
        U32 bCRD        : 1;
        U32 bSTATIC     : 1;
        U32 bPUL_C      : 1;
        U32 bPUL_D      : 1;
        U32 bPUL_S      : 1;
        U32 bLINE_D     : 1;
        U32 bIF         : 1;
        U32 bELSE       : 1;
        U32 bVAR_OPT    : 1;
        U32 bCYC        : 1;
        U32 bPUL_INT    : 1;
        U32 bPUL_PN     : 1;
        U32 bEXT_CTRL   : 1;
        U32 bCRC        : 1;
        U32 bREV        : 1;    // 保留位
    } bits;    
    U32 word;    
    
}   unWmFunc;
//----------------------------------------------------------------------------------------------------
//  cDev.exfunc_cfg 设备扩展功能位配置 （0：屏蔽，1：开启）
//----------
#define   EXFUNC_BIT_IR         ((U32)(1 << 0))   // 内阻测试 功能位
#define   EXFUNC_BIT_NOBEEP     ((U32)(1 << 1))   // 屏蔽蜂鸣报警 功能位
#define   EXFUNC_BIT_INPLACE    ((U32)(1 << 2))   // 托盘位到位报警 功能位
#define   EXFUNC_BIT_AUTOLIFT   ((U32)(1 << 3))   // 区结束自动抬升针床 功能位
#define   EXFUNC_BIT_WRUNLIFT   ((U32)(1 << 4))   // 区运行允许抬升针床 功能位
#define   EXFUNC_BIT_MANOUT     ((U32)(1 << 5))   // 人工控制开关量输出 功能位

#define   EXFUNC_BIT_REV        ((U32)(1 << 6))   // 保留 功能位

//----- 默认开启扩展模式 -----
#define   DEFAULT_EXFUNC_BIT     (0)

//----- 数据类型位定义 -----   // 16-0505
typedef union   _unExFunc_
{
    struct {
        U32 bIR         : 1;
        U32 bNOBEEP     : 1;
        U32 bINPLACE    : 1;
        U32 bAUTOLIFT   : 1;
        U32 bWRUNLIFT   : 1;
        U32 bMANOUT     : 1;
        U32 bREV        : 1;    // 保留位
     
    } bits;    
    U32 word;    
    
}   unExFunc;
//----------------------------------------------------------------------------------------------------
typedef struct _strCtrlCfg_     //14-0724 -> 76Bytes MAX:256Bytes
{
    U32 Mark;             // 标记

    U8  bPdResumeMode;    // 掉电恢复与否 默认：1 - 允许
    U8  bStepSyncFlag;    // 阶段同步与否 默认：1 - 允许
    U8  bParallel;        // 允许并联与否 默认：0 - 禁止
    U8  bAbnResume;       // 故障恢复与否 默认：0 - 禁止

    U8  MaxViBdNum;       // 最大巡检电压板数，N/A
    U8  MaxTiBdNum;       // 最大巡检温度板数，N/A
    U8  MaxIiBdNum;       // 最大开关量输入板数，N/A
    U8  MaxOiBdNum;       // 最大开关量输出板数，N/A

    U8  MaxEBiBdNum;      // 最大扩展位输入板数，N/A
    U8  MaxEBoBdNum;      // 最大扩展位输出板数，N/A
    U8  MaxEDiBdNum;      // 最大扩展数据输入板数，N/A
    U8  MaxEDoBdNum;      // 最大扩展数据输出板数，N/A

    U8  BoardViNum;       // 板级巡检电压数
    U8  BoardTiNum;       // 板级巡检温度数
    U8  BoardIiNum;       // 板级开关量输入数
    U8  BoardOiNum;       // 板级开关量输出数

    U8  BoardExBiNum;     // 板级扩展位输入数
    U8  BoardExBoNum;     // 板级扩展位输出数
    U8  BoardExDiNum;     // 板级扩展数据输入数
    U8  BoardExDoNum;     // 板级扩展数据输出数

    U16 CanOff_n;         // CAN超时计数器（收不到任何通道的包）
    U16 CtrlRetry_n;      //（控制故障时）重试次数
    U16 CanRetry_n;       //（通信故障时）重试次数
    U16 CtrlRetry_t;      //（控制故障时）重试间隔（mS）

    U16 CanRetry_t;       //（通信故障时）重试间隔（mS）
    U16 PDResume_t;       // 掉电恢复周期  0 表示不恢复，否则代表恢复倒计数时间 （mS）
//    U16 CtrlDT;           // 控制死区时间
    U16 Vdelta;           // 恒流转换电压控制差值（mV）：恒流下发控制电压 = 差值+转换电压 15-0113
    U16 StartDly_t;       // 启动延时单元

    U16 XCurJdg_t;        // 电流异常判断周期   (mS)
    U16 XVolJdg_t;        // 电压异常判断周期   (mS)
    U16 XTempJdg_t;       // 温度异常判断周期   (mS)
    U16 XViJdg_t;         // 单体电压异常判断周期 (mS)

    U16 XTiJdg_t;         // 单体温度异常判断周期 (mS)
    U16 IOJdg_t;          // 开关量响应判断周期  (mS)
    U16 VpotJdg_t;        // 平台电压响应判断周期 (mS)
    U16 CurJdg_t;         // 电流 判断响应周期  (mS)

    U16 VolJdg_t;         // 电压 判断响应周期  (mS)
    U16 PowJdg_t;         // 功率 判断响应周期  (mS)
    U16 EngyJdg_t;        // 瓦时 判断响应周期  (mS)
    U16 ViJdg_t;          // 单体电压 判断响应周期 (mS)

    U16 TiJdg_t;          // 单体温度 判断响应周期 (mS)
    U16 Record_t;         // 默认记录间隔 (mS)

    U8  Vi_Dot;           // 单体电压小数位
    U8  Ti_Dot;           // 单体温度小数位
    U8  bAutoReset;       // 自动复位与否 默认：0 - 禁止
    U8  bMainSubOrder;    // 主从CAN次序 默认：0 - CAN1主，CAN2从

    U8  MainChanType;     // 主控设备类型 默认：0 - 通用
    U8  SubChanType;      // 辅助设备类型 默认：0 - 通用

    U16 crc;              // CRC效验和

}   strCtrlCfg;
//----------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------
// 辅助通道配置表
typedef struct _strSubChCfg_    // MAX:256Bytes
{
    U32   Mark;         // 标记

    U16   Rev;
    U16   crc;          // CRC效验和

} strSubChCfg;
//------------------------------------------------------------------------------------------
// 单体电压硬件配置表(上位机设置)
typedef struct _strViHdCfg_     // 48bytes
{
    U32   Mark;                 // 标记
    U8    HdTbl[MAX_VI_BOARD];  // 采样点数
    U16   UseNum;               // 配置板数 必须<MAX_OI_BOARD
    U16   crc;                  // CRC效验和

} strViHdCfg;
//------------------------------
// 单体电压硬件检索表(软件设置)
typedef struct _strViHdChk_
{
    U16   GblInx[MAX_VI_BOARD]; // 全局索引

} strViHdChk;
//------------------------------------------------------------------------------------------
// 单体温度硬件配置表(上位机设置)
typedef struct _strTiHdCfg_     // 48bytes
{
    U32   Mark;                 // 标记
    U8    HdTbl[MAX_TI_BOARD];  // 采样点数
    U16   UseNum;               // 配置板数 必须<MAX_TI_BOARD
    U16   crc;                  // CRC效验和

} strTiHdCfg;
//------------------------------
// 单体温度硬件检索表(软件设置)
typedef struct _strTiHdChk_
{
    U16   GblInx[MAX_TI_BOARD]; // 全局索引

} strTiHdChk;
//------------------------------------------------------------------------------------------
// 开关量入硬件配置表(上位机设置)
typedef struct _strIiHdCfg_     // 28bytes
{
    U32   Mark;                 // 标记
    U8    HdTbl[MAX_II_BOARD];  // 采样点数
    U16   UseNum;               // 配置板数 必须<MAX_II_BOARD
    U16   crc;                  // CRC效验和

} strIiHdCfg;
//------------------------------
// 开关量入硬件检索表(软件设置)
typedef struct _strIiHdChk_
{
    U16   GblInx[MAX_II_BOARD]; // 全局索引

} strIiHdChk;
//------------------------------------------------------------------------------------------
// 开关量出硬件配置表(上位机设置)
typedef struct _strOiHdCfg_     // 28bytes
{
    U32   Mark;                 // 标记
    U8    HdTbl[MAX_OI_BOARD];  // 采样点数
    U16   UseNum;               // 配置板数 必须<MAX_OI_BOARD
    U16   crc;                  // CRC效验和

} strOiHdCfg;
//------------------------------
// 开关量出硬件检索表(软件设置)
typedef struct _strOiHdChk_
{
    U16   GblInx[MAX_OI_BOARD]; // 全局索引

} strOiHdChk;
//------------------------------------------------------------------------------------------
// 其他通道硬件配置表(上位机设置)
typedef struct _strXiHdCfg_     // 28bytes(支持到20路时)
{
    U32   Mark;                 // 标记
    U8    HdTbl[MAX_XI_BOARD];  // 采样点数
    U16   UseNum;               // 配置板数 必须<MAX_OI_BOARD
    U16   crc;                  // CRC效验和

} strXiHdCfg;
//------------------------------
// 其他通道硬件检索表(软件设置)
typedef struct _strXiHdChk_
{
    U16   GblInx[MAX_XI_BOARD];   // 全局索引

} strXiHdChk;
//----------------------------------------------------------------------------------------------------
#define     DEVID_LEN       (32)        // 设备ID长度   （字节）
#define     DEVNAME_LEN     (32)        // 设备名称长度   （字节）
#define     CMDVERTBL_LEN   (256)       // 命令版本表长度  （字节）
#define     DEVSTR_LEN      (6)         // 设备结构表长度  （字节）
#define     SCFGTBL_LEN     (96)        // 辅助通道软配置表长度   （字节）
#define     XITEMTBL_LEN    (32)        // 实施明细其他项配置表长度 （字节）
//--------------------------------------------------------------------------
// 设备信息 Ver 1.0 128字节
// 15-1112：加入明实时明细其他项配置表，版本Ver 1.1
// 16-0125：加入通道并联数配置，版本Ver 1.2 [176字节]
//--------------------------------------------------------------------------
// V1.2
typedef struct _strDevInfo_ //MAX:512Bytes
{
            U32         mark;
/*   0*/    U8          day;
/*   1*/    U8          mon;
/*   2*/    U16         year;                   // 生产日期
/*   4*/    U8          dev_id[DEVID_LEN];      // 设备号ID（客户定义）[32]
/*  36*/    U8          dev_name[DEVNAME_LEN];  // 设备名称（厂家定义）[32]
/*  68*/    U16         soft_ver;               // 中位机软件版本号（只读）
/*  70*/    U16         hard_ver;               // 中位机硬件版本号（读写）
    
/*  72*/    U8          max_node_num;           // 最大节点数 【下位机电源数，只读 == MAX_NODE_NUM】
/*  73*/    U8          max_chan_num;           // 最大通道数 【通道类成员数，只读 == MAX_CHAN_NUM】
/*  74*/    U8          chan_num;               // 控制通道数 【用户界面（实时数据，工艺，校准等相关）】
/*  75*/    U8          par_node_num;           // 并联节点数 【线性并联，有最小数限制；并联禁止时 == 0】
    
/*  76*/    U8          ext_chan_num;           // 扩展通道数 16-0129
/*  77*/    U8          dev_str_type;           // 设备结构类型
/*  78*/    U8          dev_str_tbl[DEVSTR_LEN];// 设备结构配置表[6]

/*  84*/    float       max_chr_cur;            // 最大充电电流
/*  88*/    float       max_chr_vol;            // 最大充电电压
/*  92*/    float       max_chr_pow;            // 最大充电功率
/*  96*/    float       max_dch_cur;            // 最大放电电流
/* 100*/    float       min_dch_vol;            // 最小放电电压
/* 104*/    float       max_dch_pow;            // 最大放电功率
/* 108*/    Union32     run_fan_temp;           // 运行风机开启温度（0xffffffff表示常开）
/* 112*/    Union32     prt_fan_temp;           // 保护风机开启温度（0xffffffff表示常闭）

/* 116*/    unWmFunc    wmfunc_cfg;             // 工作模式功能开关 16-0505
/* 120*/    unExFunc    exfunc_cfg;             // 设备扩展功能开关 16-0505
/* 124*/    U32         min_rec_time;           // 最小记录时间(uS)

/* 128*/    U16         vi_num;                 // 通道电压数
/* 130*/    U16         ti_num;                 // 通道温度数
/* 132*/    U8          ii_num;                 // 通道开关量入数
/* 133*/    U8          oi_num;                 // 通道开关量出数
/* 134*/    U16         xitem_num;              // 其他项数（暂时支持最多16项）
/* 136*/    U8          xitem_tbl[XITEMTBL_LEN];// 其他项配置表[32]
                    
/* 168*/    U8          rev[2];                 // 保留对齐
/* 170*/    U16         crc;                    // crc16 MODBUS-RTU 校验
        
} strDevInfo;

// V1.1
//typedef struct _strDevInfo_ //MAX:512Bytes
//{
//            U32        mark;
///*   0*/    U8         day;
///*   1*/    U8         mon;
///*   2*/    U16        year;                    // 生产日期

///*   4*/    U8         dev_id[DEVID_LEN];       // 设备号ID（厂家定义）
///*  36*/    U8         dev_name[DEVNAME_LEN];   // 设备名称（客户定义）

///*  68*/    U16        soft_ver;                // 中位机软件版本号（只读）
///*  70*/    U16        hard_ver;                // 中位机硬件版本号（读写）

/////*  72*/      U8         cmd_ver[CMDVERTBL_LEN];  // 通信命令版本表

///*  72*/    U8         chan_num;                // 通道数
///*  73*/    U8         dev_str_type;            // 设备结构类型
///*  74*/    U8         dev_str_tbl[DEVSTR_LEN]; // 设备结构配置表

///*  80*/    float      max_chr_cur;             // 最大充电电流
///*  84*/    float      max_chr_vol;             // 最大充电电压
///*  88*/    float      max_chr_pow;             // 最大充电功率
