//----------------------------------------------------------------------------------------------------
// Header:      看门狗 
// File Name:   WatchDog.c
// Author:      David
// Date:        2013-05-27
//----------------------------------------------------------------------------------------------------
#define     IN_WDG
    #include    "stm32f4xx.h"
    #include    "RTL.h"
    #include    "sys_config.h"
    #include    "main.h"
    #include    "led.h"
    #include    "watchdog.h"
//----------------------------------------------------------------------------------------------------
#define     DBGMCU_CR_ADDR      0xE0042004  // 调试MCU配置寄存器地址
//----------------------------------------------------------------------------------------------------
#define IWDG_PERIOD     200000UL                                    // 看门狗周期 2S -> 0.2S 15-1228 
#define IWDG_PR         4
#define IWGDCLK         (40000UL / (0x04 << IWDG_PR))               // 40KHz 看门狗振荡器频率
#define IWDG_RLR        (IWDG_PERIOD * IWGDCLK / 1000000UL -  1)
//----------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------
//  初始化片内独立看门狗 
//-------------------------------------------------------------------------------
void IWdg_Init(void)
{
    IWDG->KR  = 0x5555;                             /* enable write to PR, RLR  */
    IWDG->PR  = IWDG_PR;                            /* Init prescaler           */
    IWDG->RLR = IWDG_RLR;                           /* Init RLR                 */
    IWDG->KR  = 0xAAAA;                             /* Reload the watchdog      */
    IWDG->KR  = 0xCCCC;                             /* Start the watchdog       */

    // 调试时独立看门狗计数设定
//    DBGMCU->APB1FZ  |= DBGMCU_APB1_FZ_DBG_IWDG_STOP;    // 禁止独立看门狗计数
}
/*----------------------------------------------------------------------------
  Window WatchDog Update Interrupt Handler
 *----------------------------------------------------------------------------*/
void WWDG_IRQHandler (void) 
{
    
}
//----------------------------------------------------------------------------------------------------
//  系统异常程序处理
//----------------------------------------------------------------------------------------------------
void HardFault_Handler (void)
{
    HardFault_Display();
//    IWdg_Init();
}
//----------------------------------------------------------------------------------------------------
//eof
